
//1 Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом: кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?». Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100, поділи навпіл і отримай 50. Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100. І так до тих пір, поки користувач не вибере == N (буде корисним почитати про алгоритм: "бінарний пошук").
let eins = prompt("Введите число от 1 до 100","");
let zwei = prompt("Угадайте число от 1 до 100","");
let eins = parseInt(eins);
let zwei = parseInt(zwei);
    
if(zwei<eins){a="Больше"};
if(zwei>eins){a="Меньше"};
if(zwei == eins){a="Угадал"}; 

alert(a);

//2 Виведи таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.
const number = parseInt(prompt("Enter an integer: "));
for (let i = 1; i <= 10; i++) {
  const result = i * number;
  console.log(`${number} * ${i} = ${result}`);
}

// Запитай дату (день, місяць, рік) і виведи наступну за нею дату. Враховуй можливість переходу на наступний місяць, рік, а також високосний рік.
let yesterday = function (date1) {
    let dt = new Date(date1);
    return new Date(dt.setDate(dt.getDate() + 1)).toString();
  };
  console.log(yesterday("Feb 12, 2022"));
  